# Exfiltrated sensitive data through cURL binary.
# Required fields
# - EventID
# - Image
# - CommandLine
title: Curl Exfiltration
id: 437723fe-fcd2-4f9f-a66e-84c5a5820d5a
status: experimental
description: Détecte l'exfiltration de données par l'utilisation de l'outil cURL.
author: Étienne Lacroix
date: 2023/07/29
references:
    - https://www.man7.org/linux/man-pages/man1/curl.1.html # -d, --data <data>
tags:
    - attack.exfiltration
    - attack.t1041
logsource:
    product: windows
    service: sysmon
detection:
    selection:
        EventID: 1
        Image|endswith: curl.exe
        CommandLine|contains:
            - ' -d '
            - ' --data '
            - ' --data-binary '
    condition: selection
fields:
    - EventID
    - Image
    - CommandLine
falsepositives:
     - Unknown
level: critical
