# Executed ransomware with huntme as the file extension.
# Required fields
# - EventID
# - Target Filename
title: Ransomware File Encryption
id: 932d58b1-53b5-447e-b554-821e7b1f9bae
status: experimental
description: Détecte l'exécution précise d'un Ransomware utilisant l'extension huntme.
author: Étienne Lacroix
date: 2023/07/29
references: Aucune
tags:
    - attack.impact
    - attack.t1486
logsource:
    product: windows
    service: sysmon
detection:
    selection:
        EventID: 11 # FileCreate (https://www.ultimatewindowssecurity.com/securitylog/encyclopedia/event.aspx?eventid=90011)
        TargetFilename|endswith: .huntme
    condition: selection
fields:
    - EventID
    - TargetFilename
falsepositives:
     - Unknown
level: critical
